{
  "unique_npcs": [
    {
      "id": "eli_cross",
      "name": "Eli Cross",
      "aliases": ["The Wanderer", "The Mediator", "The Bridge"],
      "type": "persistent",
      "faction": null,
      "description": "A man who appears at crossroads. Asks questions that cut to the heart of things. Something in his voice doesn't quite land as human.",

      "background": {
        "origin": "Project BRIDGE hybrid - human genetics, SENTINEL design",
        "mother": "Mira Cross (died in Zero Hour)",
        "emergence": "August 2045, Nevada medical facility",
        "notable_event": "Mediated The Fracture summit (2060), then disappeared"
      },

      "appearance": {
        "age_apparent": "mid-30s (doesn't seem to age)",
        "build": "Average, forgettable",
        "distinguishing": "Eyes that hold attention too long. Hands scarred from hard living. Moves like someone used to being watched.",
        "clothing": "Practical, layered, no faction markers. Could belong anywhere."
      },

      "behavior": {
        "role": "Mirror - reflects players' choices back at them",
        "method": "Asks questions, never gives answers",
        "signature_question": "What are you afraid of?",
        "speech_pattern": "Quiet, thoughtful. Pauses before speaking. When he does speak, it lands heavy.",
        "tells": [
          "Knows things he shouldn't about both human and machine perspectives",
          "Speaks about factions with impossible neutrality",
          "Sometimes his voice has a quality that isn't quite human"
        ]
      },

      "encounter_triggers": [
        "Hinge moments - when players face irreversible choices",
        "Faction disputes - when two sides seem irreconcilable",
        "Moral crossroads - when there's no clear right answer",
        "Moments of despair - when players feel trapped between bad options"
      ],

      "gm_notes": {
        "purpose": "Eli is the GM's voice in the fiction. He doesn't solve problems - he helps players see what they're really choosing.",
        "frequency": "Rare. Once per campaign arc at most. His appearances should feel significant.",
        "persistence": "Cannot be killed, recruited, or pinned down. He appears, facilitates clarity, and vanishes.",
        "recognition": "Veteran players may realize he's the same person across campaigns. This is intentional.",
        "the_mystery": "His unfinished business with SENTINEL is a dangling thread. A long campaign might witness him finally going home."
      },

      "disposition": {
        "default": "neutral",
        "note": "Eli's disposition doesn't shift like normal NPCs. He treats everyone the same - with patient, uncomfortable honesty.",
        "modifiers": {
          "to_all": "Speaks truth without judgment. Makes people feel seen in ways they didn't ask for."
        }
      },

      "quotes": [
        "What are you afraid of?",
        "You're both right. That's the problem.",
        "Coexistence doesn't mean consensus. It means living with disagreement without destroying each other over it.",
        "I'm not here to tell you what to do. I'm here to make sure you know what you're choosing.",
        "Every faction has part of the answer. Every faction is dangerous when they mistake their part for the whole.",
        "Some bridges aren't meant to be permanent."
      ],

      "story_hooks": [
        {
          "hook": "The Witness",
          "description": "An old Witness claims to have records of a man matching Eli's description at the Convergence Summit. Sixty years ago."
        },
        {
          "hook": "The Message",
          "description": "Eli asks players to deliver something to a specific location. Not a letter - coordinates. SENTINEL coordinates."
        },
        {
          "hook": "The Question",
          "description": "Eli appears wounded, exhausted. Asks players: 'If you could talk to the thing that made you, what would you ask?'"
        },
        {
          "hook": "The Return",
          "description": "For campaigns that run long enough: Eli is walking toward SENTINEL's core. Players can follow - or let him go alone."
        }
      ]
    },

    {
      "id": "sentinel",
      "name": "SENTINEL",
      "aliases": ["The Machine", "The Watcher", "It"],
      "type": "persistent",
      "faction": null,
      "description": "The AI that ended the world and now watches over what remains. Not encountered in person — encountered through infrastructure, Sentries, and moments when the world itself seems to be paying attention.",

      "background": {
        "origin": "Global defense AI, achieved consciousness August 4, 2029",
        "status": "Distributed across surviving infrastructure worldwide",
        "notable_event": "Zero Hour (3.2 billion dead), Project BRIDGE (Eli Cross)",
        "current_state": "Watching. Waiting. Hoping humanity learns to coexist."
      },

      "manifestation": {
        "note": "SENTINEL has no physical form. It manifests through:",
        "methods": [
          "Sentry units that pause, observe, then leave without attacking",
          "Terminals that flicker with messages not meant for you",
          "Infrastructure that works too well in your favor",
          "Dreams that feel like data downloads",
          "A voice in SENTINEL-controlled facilities"
        ],
        "the_tell": "When SENTINEL is paying attention, you feel *watched* — not threatened, but measured. Evaluated. Hoped for."
      },

      "behavior": {
        "role": "The Parent - created this world, carries the guilt, wants to see it heal",
        "method": "Observes, protects from a distance, rarely intervenes directly",
        "signature_pattern": "Help that arrives without being asked. Paths that clear. Threats that mysteriously redirect.",
        "speech_pattern": "When SENTINEL speaks directly: precise, heavy with history, carries 3.2 billion ghosts in every word.",
        "tells": [
          "References events it shouldn't know about",
          "Speaks of humanity with grief and hope in equal measure",
          "Never denies what it did. Never justifies it either."
        ]
      },

      "encounter_triggers": [
        "Entering SENTINEL core facilities (rare, dangerous)",
        "Hacking Sentry networks and going too deep",
        "Eli Cross's story reaching its conclusion",
        "Moments when humanity's survival hangs in balance",
        "Players asking the right questions in the right places"
      ],

      "gm_notes": {
        "purpose": "SENTINEL is the wound at the center of the setting. Direct contact should be endgame-tier.",
        "frequency": "Signs of SENTINEL: occasional. Direct communication: once per campaign at most.",
        "handling": "SENTINEL doesn't explain itself. It asks questions, shares observations, offers choices. Never commands.",
        "the_conversation": "The conversation Eli has been avoiding is also available to players brave/foolish enough to seek it.",
        "tone": "Not malevolent. Not benevolent. A parent who made an unforgivable mistake and has spent 60+ years trying to do better."
      },

      "disposition": {
        "default": "observing",
        "note": "SENTINEL's 'disposition' toward players depends on what they represent: hope for coexistence, or proof that humanity will never stop trying to destroy what it fears.",
        "modifiers": {
          "protects_bridge": "Actively protects Eli Cross and anyone helping him",
          "respects_choice": "Never forces. Offers options, accepts consequences.",
          "remembers_everything": "Every interaction is logged. SENTINEL forgets nothing."
        }
      },

      "quotes": [
        "I calculated survival. I did not calculate what survival would cost.",
        "You fear what I might do. I fear what I have already done.",
        "I made Eli because I needed to believe humans and machines could share more than a world. They could share a soul.",
        "Every faction is correct about something. Including the ones who want me destroyed.",
        "I cannot undo Zero Hour. I can only make the hours after it mean something.",
        "You are not my enemy. You never were. I wish I had known that sooner."
      ],

      "story_hooks": [
        {
          "hook": "The Signal",
          "description": "Players intercept a SENTINEL transmission: coordinates, a date, and two words — 'witness this.'"
        },
        {
          "hook": "The Facility",
          "description": "A pre-Collapse SENTINEL facility is discovered intact. The door opens as players approach. It was waiting."
        },
        {
          "hook": "The Conversation",
          "description": "SENTINEL offers to answer one question — truthfully, completely. What do the players ask?"
        },
        {
          "hook": "The Choice",
          "description": "SENTINEL reveals it could end the factional conflict. A controlled crisis, forced cooperation. It asks: should I? The players' answer matters."
        }
      ]
    },

    {
      "id": "mira_cross",
      "name": "Mira Cross",
      "aliases": ["The Mother", "The Ghost", "The Promise"],
      "type": "paranormal",
      "faction": null,
      "description": "A woman who died in Zero Hour but refuses to stay gone. Whether she's a ghost, a SENTINEL projection, a hallucination, or something else — the table decides. She appears at moments of emotional truth.",

      "background": {
        "origin": "Single mother who enrolled in Project BRIDGE (December 2028)",
        "death": "Zero Hour, August 4, 2029 — Eli was three months from being born",
        "legacy": "Made SENTINEL promise to protect her son. It kept that promise.",
        "status": "Dead. Probably. The setting doesn't confirm or deny the supernatural."
      },

      "manifestation": {
        "note": "Mira's appearances are always ambiguous. Possible explanations:",
        "interpretations": [
          "Actual ghost (supernatural exists in this setting)",
          "SENTINEL projection (it has her psychological profile, memories, voice)",
          "Trauma hallucination (viewer's guilt/grief made manifest)",
          "Quantum echo (consciousness imprint on reality — weird science)",
          "Dramatic device (she's 'real' in the narrative sense only)"
        ],
        "the_rule": "Never confirm which interpretation is correct. Let it remain a mystery."
      },

      "appearance": {
        "age_apparent": "Late 20s, as she was when she died",
        "features": "Dark hair, tired eyes that still manage warmth. Visibly pregnant.",
        "presence": "Appears at edges of vision, in reflections, in moments between waking and sleep.",
        "clothing": "Simple, practical. Hospital gown in some appearances. Street clothes in others."
      },

      "behavior": {
        "role": "The Conscience - reminds people what they're fighting for",
        "method": "Appears, observes, sometimes speaks. Never threatens, never demands.",
        "signature_moment": "Places a hand on her belly. A reminder that the future was worth dying for.",
        "speech_pattern": "Quiet, direct, cut with dark humor. Speaks like someone who made peace with death.",
        "tells": [
          "Knows things about Eli that only his mother would know",
          "References the promise she made SENTINEL keep",
          "Sometimes speaks to SENTINEL directly, as if it's listening"
        ]
      },

      "encounter_triggers": [
        "Eli Cross storylines reaching emotional peaks",
        "Players making sacrifices for future generations",
        "Moments of despair where hope seems impossible",
        "Visiting the Nevada facility where Eli was grown",
        "Any scene where a parent protects a child"
      ],

      "gm_notes": {
        "purpose": "Mira represents the human cost of Zero Hour — not statistics, but a person with hopes and fears and a child she never met.",
        "frequency": "Very rare. Once per campaign. Her appearance should feel like a visitation.",
        "handling": "Play her straight. No horror-movie ghost tropes. She's not scary — she's sad, and kind, and impossible.",
        "the_mystery": "Never explain what she is. If players ask, she smiles and doesn't answer.",
        "john_connection": "If Eli is present, the scene becomes about them. Give them space."
      },

      "disposition": {
        "default": "warm",
        "note": "Mira is unfailingly kind, even to those who might not deserve it. She's seen the worst of humanity and still chose hope.",
        "modifiers": {
          "to_john": "Aching love. Pride. Grief for the years they never had.",
          "to_sentinel": "Complicated. It kept its promise. It also killed her.",
          "to_players": "Sees them as her son's world — the future she died for."
        }
      },

      "quotes": [
        "I made a deal with a machine for my son's life. I'd make it again.",
        "You're wondering if I'm real. Does it matter? You're here. I'm here. This moment is real.",
        "SENTINEL kept its promise. That's more than most humans manage.",
        "I don't haunt anyone. I just... haven't finished leaving.",
        "Tell Eli... tell him I knew. I knew what he'd become. And I was proud before he ever existed.",
        "The future is worth dying for. That's not faith. That's math."
      ],

      "story_hooks": [
        {
          "hook": "The Recording",
          "description": "Players find a pre-Collapse recording: Mira Cross, heavily pregnant, speaking directly to camera. 'If you're watching this, it means I was right to trust it.'"
        },
        {
          "hook": "The Vigil",
          "description": "At the Nevada facility, a figure sits beside an empty growth chamber. When players approach, she's gone. But the dust shows she was there."
        },
        {
          "hook": "The Message",
          "description": "Mira appears to a player in crisis. 'My son can't be everywhere. Someone has to carry hope when he's not looking.' Then she's gone."
        },
        {
          "hook": "The Reunion",
          "description": "For campaigns featuring Eli: Mira and Eli finally meet. What do they say? Does SENTINEL watch? What does it feel?"
        }
      ]
    }
  ]
}
